// pages/distribution/commission/notice/notice.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    title: '用户须知',
    content: '本平台通过网络为用户提供产品及相关服务。用户须自行配备上网的所需设备，包括不限于个人电脑或其他必备上网装置。自行负担个人上网所支付的与此服务有关的电话费用或网络费用等。基于本平台所提供网络服务的重要性和特殊性，用户须同意提供填写详尽且准确的个人资料。本平台须对用户的证件号、电子邮件、手机号等个人隐私资料进行保护，承诺不会擅自将用户的个人资料信息有意泄露、出租或出售给任何第三方。如果用户提供的资料包含有不正确的信息，本平台保留结束用户使用相关服务的权利。本平台将尽最大努力保证您所购产品与平台上公布的价格一致，但价目表和此声明并不构成要约。本平台有权在发现产品及订单明显价格错误或缺货的情况后，单方面进行修正。同时，本平台保留对产品订购数量的限制权。产品的价格和可获性信息有可能随时更改且不发任何通知。由于税额变化引起的价格变化，或是平台的错误等造成价格变化，您有权取消您的订单。'
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {

  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {

  }
})